In [1]:
import pandas as pd

In [2]:
dados = {'emprego': ['Administrador_banco_dados', 'Programador', 'Aquiteto_redes'],
        'nova_jersey': [97350,  82080, 112840],
        'florida': [77140, 71540, 62310]}

In [3]:
dataset = pd.DataFrame(dados)

In [4]:
dataset

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2             Aquiteto_redes       112840    62310

In [5]:
dataset['$_nova_jersey'] = (dataset['nova_jersey'] / dataset['nova_jersey']. sum()) * 100

In [6]:
dataset['$_nova_florida'] = (dataset['florida'] / dataset['florida']. sum()) * 100

In [7]:
dataset

,emprego,nova_jersey,florida,$_nova_jersey,$_nova_florida
0,Administrador_banco_dados,97350,77140,33.308242,36.560974
1,Programador,82080,71540,28.083621,33.906820
2,Aquiteto_redes,112840,62310,38.608136,29.532205